[
  {
    "id": "1",
    "title": "Розділ 1. Загальні положення",
    "description": "Основні терміни, загальні вимоги та базові принципи дорожнього руху в Україні.",
    "imagePath": null,
    "theory": [
      {
        "number": "1.1",
        "title": "Поняття Правил дорожнього руху",
        "text": "Правила дорожнього руху встановлюють єдиний порядок організації руху на дорогах України і є обов’язковими для всіх учасників руху.",
        "imagePath": null
      },
      {
        "number": "1.2",
        "title": "Учасники дорожнього руху",
        "text": "До учасників дорожнього руху належать водії, пішоходи, пасажири, велосипедисти, погоничі тварин, а також інші особи, які беруть участь у процесі руху.",
        "imagePath": null
      },
      {
        "number": "1.3",
        "title": "Правосторонній рух",
        "text": "В Україні діє правосторонній рух: усі транспортні засоби повинні рухатися правою стороною проїзної частини.",
        "imagePath": "assets/images/right_drive.jpg"
      },
      {
        "number": "1.4",
        "title": "Взаємна повага",
        "text": "Учасники дорожнього руху повинні керуватися принципами взаємної поваги, не створювати небезпеку або перешкоди для інших.",
        "imagePath": null
      },
      {
        "number": "1.5",
        "title": "Безпека дорожнього руху",
        "text": "Ніхто не має права завдавати шкоди учасникам дорожнього руху, транспортним засобам, спорудам чи навколишньому середовищу.",
        "imagePath": null
      },
      {
        "number": "1.6",
        "title": "Вимоги нормативних актів",
        "text": "Усі учасники дорожнього руху зобов’язані виконувати вимоги законів України, Правил дорожнього руху, наказів та постанов, що стосуються безпеки.",
        "imagePath": null
      },
      {
        "number": "1.7",
        "title": "Дії у випадку відсутності регулювання",
        "text": "Якщо певна дорожня ситуація не врегульована нормативними актами, учасники повинні діяти з урахуванням безпеки та взаємної поваги.",
        "imagePath": null
      },
      {
        "number": "1.8",
        "title": "Перевага дорожніх знаків і сигналів",
        "text": "У разі розбіжності між вимогами Правил і дорожніми знаками або сигналами регулювальника — перевагу мають знаки та сигнали.",
        "imagePath": "assets/images/sign_priority.jpg"
      },
      {
        "number": "1.9",
        "title": "Відповідальність за порушення",
        "text": "Особи, які порушують Правила дорожнього руху, несуть адміністративну, цивільну або кримінальну відповідальність відповідно до законодавства.",
        "imagePath": null
      },
      {
        "number": "1.10",
        "title": "Рівність усіх учасників руху",
        "text": "Усі учасники дорожнього руху мають рівні права та обов’язки, незалежно від їх статусу чи виду транспортного засобу.",
        "imagePath": null
      },
      {
        "number": "1.11",
        "title": "Особливі умови руху",
        "text": "При виникненні складних умов руху (туман, ожеледиця, сильний дощ, аварія) учасники повинні діяти особливо обережно та знижувати швидкість.",
        "imagePath": null
      },
      {
        "number": "1.12",
        "title": "Використання доріг",
        "text": "Дороги загального користування призначені для руху транспортних засобів та учасників руху. Забороняється використовувати дороги для змагань без дозволу.",
        "imagePath": null
      },
      {
        "number": "1.13",
        "title": "Обмеження руху",
        "text": "Рух може бути тимчасово обмежений або заборонений у випадках аварій, ремонтів, стихійних лих або за рішенням відповідних служб.",
        "imagePath": null
      },
      {
        "number": "1.14",
        "title": "Обов’язок знати ПДР",
        "text": "Кожен водій зобов’язаний знати та неухильно виконувати Правила дорожнього руху, а також підтримувати технічний стан свого транспортного засобу.",
        "imagePath": null
      },
      {
        "number": "1.15",
        "title": "Особливості для іноземців",
        "text": "Іноземні громадяни, які керують транспортними засобами на території України, повинні виконувати вимоги ПДР на загальних підставах.",
        "imagePath": null
      }
    ]
  },
  {
    "id": "2",
    "title": "Розділ 2. Обов’язки і права водіїв",
    "description": "Основні обов’язки та права водіїв транспортних засобів під час дорожнього руху.",
    "imagePath": null,
    "theory": [
      {
        "number": "2.1",
        "title": "Основні обов’язки водія",
        "text": "Водій зобов’язаний знати й виконувати вимоги ПДР, стежити за технічним станом транспортного засобу та забезпечувати безпеку дорожнього руху.",
        "imagePath": null
      },
      {
        "number": "2.2",
        "title": "Наявність документів",
        "text": "Водій повинен мати при собі посвідчення водія, реєстраційний документ на транспортний засіб, страховий поліс та пред’являти їх на вимогу поліції.",
        "imagePath": "assets/images/driver_docs.jpg"
      },
      {
        "number": "2.3",
        "title": "Стан водія",
        "text": "Заборонено керувати транспортним засобом у стані алкогольного, наркотичного або іншого сп’яніння, а також під впливом ліків, що знижують увагу.",
        "imagePath": "assets/images/no_alcohol.jpg"
      },
      {
        "number": "2.4",
        "title": "Технічний стан автомобіля",
        "text": "Перед виїздом водій повинен перевірити технічний стан ТЗ: гальма, кермо, світлові прилади, шини, склоочисники тощо.",
        "imagePath": null
      },
      {
        "number": "2.5",
        "title": "Використання ременів безпеки",
        "text": "Водій та пасажири повинні користуватися ременями безпеки. Заборонено рух без пристебнутих пасажирів (крім випадків, передбачених законом).",
        "imagePath": "assets/images/seatbelt.jpg"
      },
      {
        "number": "2.6",
        "title": "Обов’язки щодо пасажирів",
        "text": "Водій повинен забезпечити безпеку пасажирів: посадку, висадку, перевезення дітей за всіма встановленими вимогами.",
        "imagePath": null
      },
      {
        "number": "2.7",
        "title": "Маневрування",
        "text": "Водій повинен перед маневром подати відповідний сигнал і переконатися у його безпечності для інших учасників руху.",
        "imagePath": "assets/images/turn_signal.jpg"
      },
      {
        "number": "2.8",
        "title": "Виконання сигналів регулювальника",
        "text": "Водій зобов’язаний виконувати сигнали регулювальника навіть у разі суперечності з дорожніми знаками чи світлофорами.",
        "imagePath": "assets/images/regulator.jpg"
      },
      {
        "number": "2.9",
        "title": "Рух у колонах",
        "text": "Водії повинні дотримуватись інтервалу та дистанції, не створювати перешкод та не врізатися у колони військової техніки чи спецтранспорту.",
        "imagePath": null
      },
      {
        "number": "2.10",
        "title": "Зупинка на вимогу поліції",
        "text": "Водій зобов’язаний негайно зупинити транспортний засіб на вимогу поліцейського і залишатися на місці до закінчення перевірки.",
        "imagePath": null
      },
      {
        "number": "2.11",
        "title": "Забезпечення безпеки руху",
        "text": "Під час руху водій повинен бути уважним, контролювати швидкість, дистанцію, дорожні умови та не відволікатися.",
        "imagePath": null
      },
      {
        "number": "2.12",
        "title": "Використання зовнішніх світлових приладів",
        "text": "Ближнє світло фар повинно бути увімкнене поза населеними пунктами та за умов поганої видимості. Водій повинен перемикати світло, не засліплюючи інших.",
        "imagePath": null
      },
      {
        "number": "2.13",
        "title": "Права водія",
        "text": "Водій має право на безпечні дорожні умови, відмовитися від експлуатації несправного ТЗ та вимагати дотримання своїх прав від інших учасників руху.",
        "imagePath": null
      },
      {
        "number": "2.14",
        "title": "Право на захист",
        "text": "Водій має право подавати скарги на неправомірні дії посадових осіб, вимагати роз’яснення своїх прав та обґрунтування рішень поліції.",
        "imagePath": null
      },
      {
        "number": "2.15",
        "title": "Заборони для водія",
        "text": "Заборонено користуватися телефоном без hands-free, їсти, курити або займатися будь-якими діями, що відволікають від керування.",
        "imagePath": "assets/images/no_phone.jpg"
      },
      {
        "number": "2.16",
        "title": "Участь у ДТП",
        "text": "Водій, причетний до ДТП, зобов’язаний негайно зупинитись, увімкнути аварійну сигналізацію, виставити знак аварійної зупинки та повідомити поліцію.",
        "imagePath": "assets/images/accident_warning.jpg"
      }
    ]
  },
  {
    "id": "3",
    "title": "Розділ 3. Рух транспортних засобів із спеціальними сигналами",
    "description": "Правила надання переваги спеціальному транспорту з проблисковими маячками та сиренами.",
    "imagePath": null,
    "theory": [
      {
        "number": "3.1",
        "title": "Транспортні засоби спеціального призначення",
        "text": "До спецтранспорту належать автомобілі поліції, швидкої допомоги, пожежної служби, аварійних служб та інші ТЗ із встановленими спеціальними сигналами.",
        "imagePath": null
      },
      {
        "number": "3.2",
        "title": "Проблискові маячки",
        "text": "Сині та червоні проблискові маячки разом із увімкненою сиреною надають спеціальному транспорту повну перевагу в русі.",
        "imagePath": "assets/images/blue_red_lights.jpg"
      },
      {
        "number": "3.3",
        "title": "Обов’язки водіїв при наближенні спецтранспорту",
        "text": "Водії зобов’язані надати дорогу транспортним засобам із увімкненими маячками та звуковими сигналами, звільнити смугу і зупинитися при потребі.",
        "imagePath": null
      },
      {
        "number": "3.4",
        "title": "Просування у щільному потоці",
        "text": "У щільному русі водії повинні створити «коридор» для спецтранспорту — роз’їхатися в сторони для безперешкодного проїзду.",
        "imagePath": "assets/images/corridor.jpg"
      },
      {
        "number": "3.5",
        "title": "Червоний маячок",
        "text": "Червоний миготливий маячок сигналізує про заборону руху іншим водіям позаду такого транспортного засобу.",
        "imagePath": null
      },
      {
        "number": "3.6",
        "title": "Жовтий маячок",
        "text": "Жовтий (оранжевий) проблисковий маячок попереджає про небезпеку або роботу спецтехніки. Він не надає переваги у русі.",
        "imagePath": "assets/images/yellow_light.jpg"
      },
      {
        "number": "3.7",
        "title": "Регулювання руху супроводу",
        "text": "При русі колони, яку супроводжує спецтранспорт, усі водії зобов’язані не перешкоджати її проїзду та не врізатися в колону.",
        "imagePath": null
      },
      {
        "number": "3.8",
        "title": "Заборона обгону",
        "text": "Забороняється обганяти транспортні засоби з увімкненими маячками і супроводжувані ними колони.",
        "imagePath": null
      },
      {
        "number": "3.9",
        "title": "Дії на перехресті",
        "text": "Якщо спецтранспорт наближається до перехрестя, водії повинні звільнити рух, навіть якщо світлофор дозволяє рух.",
        "imagePath": null
      },
      {
        "number": "3.10",
        "title": "Відповідальність за ненадання переваги",
        "text": "Ненадання переваги транспортним засобам зі спеціальними сигналами тягне за собою адміністративну відповідальність та штраф.",
        "imagePath": null
      }
    ]
  },
  {
    "id": "4",
    "title": "Розділ 4. Обов’язки і права пішоходів",
    "description": "Основні правила поведінки пішоходів, їх обов’язки, права та вимоги безпеки під час руху.",
    "imagePath": null,
    "theory": [
      {
        "number": "4.1",
        "title": "Місця руху пішоходів",
        "text": "Пішоходи повинні рухатися по тротуарах і пішохідних доріжках, а за їх відсутності — по узбіччю, дотримуючись безпеки.",
        "imagePath": null
      },
      {
        "number": "4.2",
        "title": "Перехід дороги",
        "text": "Пішоходи повинні переходити проїзну частину по пішохідних переходах, а при їх відсутності — на перехресті по лінії тротуарів.",
        "imagePath": "assets/images/crosswalk.jpg"
      },
      {
        "number": "4.3",
        "title": "Регульовані переходи",
        "text": "На регульованому переході пішоходи повинні керуватися сигналами світлофора, а при наявності регулювальника — його сигналами.",
        "imagePath": null
      },
      {
        "number": "4.4",
        "title": "Нерегульовані переходи",
        "text": "На нерегульованому переході водії повинні надати дорогу пішоходам, які вже вийшли на перехід.",
        "imagePath": null
      },
      {
        "number": "4.5",
        "title": "Заборона виходу на дорогу",
        "text": "Пішоходам заборонено раптово виходити на проїзну частину або вибігати на неї — це створює небезпеку для руху.",
        "imagePath": null
      },
      {
        "number": "4.6",
        "title": "Рух узбіччям",
        "text": "Якщо немає тротуарів або доріжок, пішоходи повинні рухатися узбіччям назустріч руху транспортних засобів.",
        "imagePath": null
      },
      {
        "number": "4.7",
        "title": "Пішоходи в темну пору",
        "text": "У темну пору доби пішоходи повинні мати світловідбивні елементи для підвищення видимості на дорозі.",
        "imagePath": "assets/images/reflection.jpg"
      },
      {
        "number": "4.8",
        "title": "Заборона руху по автомагістралях",
        "text": "Пішоходам забороняється рух по автомагістралях, а також виходити на проїзну частину поза населеними пунктами без потреби.",
        "imagePath": null
      },
      {
        "number": "4.9",
        "title": "Перебування на проїзній частині",
        "text": "Пішоходам заборонено зупинятися на проїзній частині без нагальної потреби або затримувати рух транспортних засобів.",
        "imagePath": null
      },
      {
        "number": "4.10",
        "title": "Переходи з обмеженою видимістю",
        "text": "При переході дороги з поганою видимістю пішоходи повинні особливо уважно переконатися в безпечності руху.",
        "imagePath": null
      },
      {
        "number": "4.11",
        "title": "Права пішоходів",
        "text": "Пішоходи мають право на безпечні умови руху, на перевагу на пішохідних переходах та на захист своїх прав відповідно до законодавства.",
        "imagePath": null
      },
      {
        "number": "4.12",
        "title": "Відповідальність пішоходів",
        "text": "Порушення правил дорожнього руху пішоходами тягне за собою адміністративну відповідальність.",
        "imagePath": null
      }
    ]
  },
  {
    "id": "5",
    "title": "Розділ 5. Обов’язки і права велосипедистів і водіїв мопедів",
    "description": "Основні правила руху для велосипедистів та водіїв мопедів, вимоги безпеки та обмеження.",
    "imagePath": null,
    "theory": [
      {
        "number": "5.1",
        "title": "Місця руху велосипедистів",
        "text": "Велосипедисти повинні рухатися по велосипедних доріжках, а за їх відсутності — по правому краю проїзної частини або узбіччю.",
        "imagePath": "assets/images/bike_lane.jpg"
      },
      {
        "number": "5.2",
        "title": "Вік керування",
        "text": "Керувати велосипедом у дорожньому русі дозволено з 14 років. Керувати мопедом — з 16 років за наявності посвідчення категорії AM.",
        "imagePath": null
      },
      {
        "number": "5.3",
        "title": "Вимоги до обладнання",
        "text": "Велосипед повинен мати справні гальма, звуковий сигнал та світловідбивні елементи. У темну пору — передній та задній ліхтарі.",
        "imagePath": null
      },
      {
        "number": "5.4",
        "title": "Маневрування",
        "text": "Перед зміною напрямку руху велосипедисти та водії мопедів зобов'язані подавати чіткі сигнали руками або світловими покажчиками.",
        "imagePath": null
      },
      {
        "number": "5.5",
        "title": "Заборона руху по тротуарах",
        "text": "Велосипедистам заборонено рухатися по тротуарах, крім дітей до 14 років або у випадках відсутності доріжок і узбіч.",
        "imagePath": null
      },
      {
        "number": "5.6",
        "title": "Обгони і випередження",
        "text": "Під час обгону велосипедисти повинні дотримуватися безпечного інтервалу, не створювати загрози пішоходам та іншим водіям.",
        "imagePath": null
      },
      {
        "number": "5.7",
        "title": "Заборонені дії",
        "text": "Забороняється керувати велосипедом або мопедом без рук, триматися за інший транспорт, перевозити пасажирів без спеціального обладнання.",
        "imagePath": "assets/images/no_tricks.jpg"
      },
      {
        "number": "5.8",
        "title": "Перевезення вантажів",
        "text": "Вантажі на велосипеді або мопеді не повинні заважати керуванню, обмежувати огляд або виступати за габарити транспортного засобу.",
        "imagePath": null
      },
      {
        "number": "5.9",
        "title": "Проїзд через пішохідні переходи",
        "text": "Переїжджати пішохідний перехід заборонено. Велосипедист повинен спішитися й перейти його пішки.",
        "imagePath": "assets/images/bike_crosswalk.jpg"
      },
      {
        "number": "5.10",
        "title": "Рух колоною",
        "text": "Велосипедисти можуть рухатися колоною не більше як по двоє в ряд, не заважаючи іншим учасникам дорожнього руху.",
        "imagePath": null
      },
      {
        "number": "5.11",
        "title": "Право на безпеку",
        "text": "Велосипедисти та водії мопедів мають право на безпечні умови руху, а також на захист їхніх прав відповідно до законодавства.",
        "imagePath": null
      },
      {
        "number": "5.12",
        "title": "Обов’язок використовувати шолом",
        "text": "Рекомендується використовувати велосипедний або мотошолом, особливо при русі за межами населеного пункту.",
        "imagePath": "assets/images/helmet.jpg"
      }
    ]
  },
  {
    "id": "6",
    "title": "Розділ 6. Сигнали регулювальника",
    "description": "Сигнали та жести регулювальника, їх значення для водіїв, пішоходів і всіх учасників дорожнього руху.",
    "imagePath": null,
    "theory": [
      {
        "number": "6.1",
        "title": "Хто такий регулювальник",
        "text": "Регулювальник — це працівник поліції або інша уповноважена особа, яка керує дорожнім рухом за допомогою жестів, сигналів і положення тіла.",
        "imagePath": null
      },
      {
        "number": "6.2",
        "title": "Пріоритет сигналів регулювальника",
        "text": "Сигнали регулювальника мають пріоритет над дорожніми знаками, розміткою та сигналами світлофора.",
        "imagePath": "assets/images/regulator_priority.jpg"
      },
      {
        "number": "6.3",
        "title": "Положення регулювальника «Корпус повернутий боком»",
        "text": "Якщо регулювальник стоїть боком або спиною до транспортного засобу — рух заборонено. Це аналогічно червоному сигналу світлофора.",
        "imagePath": "assets/images/regulator_side.jpg"
      },
      {
        "number": "6.4",
        "title": "Положення «Обличчям або спиною»",
        "text": "Якщо регулювальник обличчям чи спиною до вас — рух заборонено для всіх, крім маршрутних ТЗ у спеціальних випадках.",
        "imagePath": null
      },
      {
        "number": "6.5",
        "title": "Положення «Руки розставлені в сторони»",
        "text": "Якщо руки розставлені в сторони або опущені вниз — рух дозволений транспортним засобам, що наближаються паралельно до напрямку рук.",
        "imagePath": "assets/images/regulator_arms.jpg"
      },
      {
        "number": "6.6",
        "title": "Жест «Піднята рука вгору»",
        "text": "Піднята вгору рука регулювальника означає заборону руху в усіх напрямках. Аналог жовтого сигналу світлофора.",
        "imagePath": "assets/images/regulator_hand_up.jpg"
      },
      {
        "number": "6.7",
        "title": "Жести для поворотів",
        "text": "Регулювальник може жестами показувати напрямок руху для окремих транспортних засобів, надаючи їм дозвіл або заборону руху.",
        "imagePath": null
      },
      {
        "number": "6.8",
        "title": "Сигнали жезлом",
        "text": "Жезл використовується для привернення уваги учасників руху. Він підсилює видимість жестів, особливо в темну пору.",
        "imagePath": "assets/images/baton.jpg"
      },
      {
        "number": "6.9",
        "title": "Сигнали свистком",
        "text": "Свисток застосовується для додаткових попереджень: короткий звук — зупинка, довгий — увага або дозволений рух.",
        "imagePath": null
      },
      {
        "number": "6.10",
        "title": "Вимога зупинки",
        "text": "Якщо регулювальник подає сигнал зупинитися, водій повинен зробити це негайно та безпечно, не створюючи перешкод іншим.",
        "imagePath": null
      },
      {
        "number": "6.11",
        "title": "Дії пішоходів",
        "text": "Пішоходи повинні керуватися сигналами регулювальника на рівні з водіями. Якщо рух заборонено — переходити дорогу не можна.",
        "imagePath": null
      },
      {
        "number": "6.12",
        "title": "Відповідальність за невиконання",
        "text": "Ігнорування сигналів регулювальника тягне за собою штраф або іншу відповідальність згідно із законом.",
        "imagePath": null
      }
    ]
  },
  {
    "id": "7",
    "title": "Розділ 7. Вимоги до велосипедистів",
    "description": "Правила руху для осіб, які керують велосипедами та іншими легкими засобами.",
    "imagePath": null,
    "theory": [
      {
        "number": "7.1",
        "title": "Місце руху велосипедистів",
        "text": "Велосипедисти повинні рухатися по велосипедних доріжках, а за їх відсутності – правим краєм проїзної частини або смугою для громадського транспорту, якщо це дозволено знаками.",
        "imagePath": null
      },
      {
        "number": "7.2",
        "title": "Вік та безпека",
        "text": "Рух по дорозі дозволяється велосипедистам, які досягли встановленого віку (як правило, 14 років) і здатні дотримуватися правил безпеки.",
        "imagePath": null
      },
      {
        "number": "7.3",
        "title": "Заборонені дії",
        "text": "Забороняється рухатися, не тримаючись за кермо, перевозити пасажирів (якщо конструкцією не передбачено), чіплятися за інші транспортні засоби та виїжджати на автомагістралі.",
        "imagePath": null
      }
    ]
  },
  {
    "id": "8",
    "title": "Розділ 8. Вимоги до осіб, які керують гужовим транспортом і тваринами",
    "description": "Правила руху возів, упряжних і верхових тварин.",
    "imagePath": null,
    "theory": [
      {
        "number": "8.1",
        "title": "Місце руху гужового транспорту",
        "text": "Гужовий транспорт і вершники повинні рухатися по правому краю проїзної частини або узбіччям, дотримуючись загальних правил дорожнього руху.",
        "imagePath": null
      },
      {
        "number": "8.2",
        "title": "Керування тваринами",
        "text": "Особа, що керує тваринами, зобов’язана мати достатні навички, не допускати їх раптового вибігання на дорогу та стежити за безпекою інших учасників.",
        "imagePath": null
      },
      {
        "number": "8.3",
        "title": "Заборонені дії",
        "text": "Забороняється залишати тварин без нагляду поблизу проїзної частини, рухатися в стані сп’яніння або перетинати дороги поза встановленими місцями руху.",
        "imagePath": null
      }
    ]
  },
  {
    "id": "9",
    "title": "Розділ 9. Регулювання дорожнього руху",
    "description": "Світлофори, регулювальники та пріоритет дорожніх знаків.",
    "imagePath": null,
    "theory": [
      {
        "number": "9.1",
        "title": "Пріоритет сигналів",
        "text": "Порядок пріоритету такий: сигнали регулювальника мають перевагу над світлофорами, сигнали світлофорів – над дорожніми знаками, а знаки – над розміткою.",
        "imagePath": null
      },
      {
        "number": "9.2",
        "title": "Сигнали світлофора",
        "text": "Зелений дозволяє рух, жовтий попереджає про зміну сигналу, червоний забороняє рух. Миготіння сигналів має попереджувальний характер.",
        "imagePath": null
      },
      {
        "number": "9.3",
        "title": "Сигнали регулювальника",
        "text": "Положення рук регулювальника визначає, кому дозволено рухатися, а кому – заборонено. Водій повинен знати значення кожного положення.",
        "imagePath": null
      }
    ]
  },
  {
    "id": "10",
    "title": "Розділ 10. Попереджувальні сигнали",
    "description": "Використання покажчиків повороту, звукового сигналу та аварійної сигналізації.",
    "imagePath": null,
    "theory": [
      {
        "number": "10.1",
        "title": "Покажчики повороту",
        "text": "Сигнали покажчиками повороту подаються завчасно перед початком маневру та вимикаються відразу після його завершення.",
        "imagePath": null
      },
      {
        "number": "10.2",
        "title": "Звуковий сигнал",
        "text": "Звуковий сигнал використовується для попередження про намір обгону чи небезпеку зіткнення; у населених пунктах – лише за необхідності запобігання аварії.",
        "imagePath": null
      },
      {
        "number": "10.3",
        "title": "Аварійна сигналізація",
        "text": "Аварійна сигналізація вмикається у разі вимушеної зупинки на дорозі, участі в ДТП чи буксирування транспортного засобу.",
        "imagePath": null
      }
    ]
  },
  {
    "id": "11",
    "title": "Розділ 11. Початок руху та зміна його напрямку",
    "description": "Правила початку руху, перестроювання, поворотів і розвороту.",
    "imagePath": null,
    "theory": [
      {
        "number": "11.1",
        "title": "Початок руху",
        "text": "Перед початком руху водій повинен переконатися в безпечності виїзду, подати необхідні сигнали та надати дорогу транспортним засобам, що вже рухаються.",
        "imagePath": null
      },
      {
        "number": "11.2",
        "title": "Зміна напрямку",
        "text": "Повороти та розвороти виконуються з дотриманням розмітки, знаків і правил пріоритету, з обов’язковою подачею сигналу повороту.",
        "imagePath": null
      },
      {
        "number": "11.3",
        "title": "Перестроювання",
        "text": "При перестроюванні водій повинен дати дорогу транспортним засобам на смузі, на яку він в’їжджає, і не створювати перешкод їх руху.",
        "imagePath": null
      }
    ]
  },
  {
    "id": "12",
    "title": "Розділ 12. Розташування транспортних засобів на дорозі",
    "description": "Вибір смуги руху, рух у кілька рядів та об’їзд перешкод.",
    "imagePath": null,
    "theory": [
      {
        "number": "12.1",
        "title": "Рух у населених пунктах",
        "text": "У населених пунктах транспортні засоби зазвичай рухаються правою смугою, а ліві смуги використовуються для обгону, повороту та інтенсивного руху.",
        "imagePath": null
      },
      {
        "number": "12.2",
        "title": "Рух поза населеними пунктами",
        "text": "Поза населеними пунктами водії мають дотримуватися безпечних інтервалів між транспортними засобами та враховувати особливості зустрічного руху.",
        "imagePath": null
      },
      {
        "number": "12.3",
        "title": "Об’їзд перешкод",
        "text": "Об’їжджаючи перешкоду, водій повинен оцінити безпеку маневру та за потреби надати дорогу зустрічному та попутному транспорту.",
        "imagePath": null
      }
    ]
  },
  {
    "id": "13",
    "title": "Розділ 13. Швидкість руху",
    "description": "Обмеження швидкості та вибір безпечної швидкості руху.",
    "imagePath": null,
    "theory": [
      {
        "number": "13.1",
        "title": "Загальні обмеження швидкості",
        "text": "Швидкість руху повинна забезпечувати водію можливість постійно контролювати транспортний засіб з урахуванням дорожніх умов, погоди та інтенсивності руху.",
        "imagePath": null
      },
      {
        "number": "13.2",
        "title": "Обмеження у населених пунктах",
        "text": "У населених пунктах діють знижені обмеження швидкості, які можуть додатково регулюватися знаками та розміткою.",
        "imagePath": null
      },
      {
        "number": "13.3",
        "title": "Небезпечні умови",
        "text": "За умов обмеженої видимості, слизького покриття або інтенсивного руху водій має зменшити швидкість до безпечного рівня, навіть якщо вона нижча від установлених обмежень.",
        "imagePath": null
      }
    ]
  },
  {
    "id": "14",
    "title": "Розділ 14. Дистанція, інтервал, зустрічний роз’їзд",
    "description": "Правила вибору безпечної дистанції та інтервалу між транспортними засобами.",
    "imagePath": null,
    "theory": [
      {
        "number": "14.1",
        "title": "Дистанція",
        "text": "Дистанція — це відстань між транспортними засобами, що рухаються в одному ряду. Вона повинна дозволяти уникнути зіткнення у разі раптового гальмування.",
        "imagePath": null
      },
      {
        "number": "14.2",
        "title": "Інтервал",
        "text": "Інтервал — відстань між транспортними засобами по ширині. Водій має обирати інтервал з урахуванням габаритів авто та дорожніх умов.",
        "imagePath": null
      },
      {
        "number": "14.3",
        "title": "Зустрічний роз’їзд",
        "text": "При зустрічному роз’їзді на вузьких ділянках дороги водії повинні зменшити швидкість, за потреби зупинитися або надати перевагу одному з транспортних засобів.",
        "imagePath": null
      }
    ]
  },
  {
    "id": "15",
    "title": "Розділ 15. Обгін",
    "description": "Порядок виконання обгону та випадки, коли він заборонений.",
    "imagePath": null,
    "theory": [
      {
        "number": "15.1",
        "title": "Початок обгону",
        "text": "Перед обгоном водій повинен переконатися, що смуга зустрічного руху вільна, маневр не заборонений знаками чи розміткою та не створить небезпеки.",
        "imagePath": null
      },
      {
        "number": "15.2",
        "title": "Завершення обгону",
        "text": "Повертаючись на зайняту раніше смугу, водій повинен забезпечити безпечну дистанцію до обганюваного транспортного засобу.",
        "imagePath": null
      },
      {
        "number": "15.3",
        "title": "Заборона обгону",
        "text": "Обгін заборонено на перехрестях, пішохідних переходах, залізничних переїздах, на ділянках з обмеженою видимістю та там, де це прямо забороняють знаки.",
        "imagePath": null
      }
    ]
  },
  {
    "id": "16",
    "title": "Розділ 16. Зупинка і стоянка",
    "description": "Правила тимчасової зупинки і тривалого паркування транспортних засобів.",
    "imagePath": null,
    "theory": [
      {
        "number": "16.1",
        "title": "Місця дозволеної зупинки",
        "text": "Зупинка і стоянка дозволяються у спеціально відведених місцях, а також біля краю проїзної частини, якщо це не суперечить знакам та розмітці.",
        "imagePath": null
      },
      {
        "number": "16.2",
        "title": "Заборонені місця",
        "text": "Заборонено зупинятися на пішохідних переходах, трамвайних коліях, мостах, у тунелях, на перехрестях та ближче встановленої відстані до них.",
        "imagePath": null
      },
      {
        "number": "16.3",
        "title": "Стоянка",
        "text": "При тривалій стоянці водій повинен вжити заходів проти самовільного руху транспортного засобу та, за потреби, увімкнути стоянкові вогні.",
        "imagePath": null
      }
    ]
  },
  {
    "id": "17",
    "title": "Розділ 17. Проїзд перехресть",
    "description": "Правила пріоритету та проїзду регульованих і нерегульованих перехресть.",
    "imagePath": null,
    "theory": [
      {
        "number": "17.1",
        "title": "Регульовані перехрестя",
        "text": "На регульованих перехрестях порядок руху визначається сигналами світлофора або регулювальника, навіть якщо знаки пріоритету встановлені інакше.",
        "imagePath": null
      },
      {
        "number": "17.2",
        "title": "Нерегульовані перехрестя",
        "text": "На нерегульованих перехрестях діють знаки пріоритету. За їх відсутності застосовується правило перешкоди справа.",
        "imagePath": null
      },
      {
        "number": "17.3",
        "title": "Повороти на перехресті",
        "text": "Поворот ліворуч і розворот виконуються з крайнього лівого ряду у напрямку руху, з урахуванням надання переваги зустрічному транспорту та пішоходам.",
        "imagePath": null
      }
    ]
  },
  {
    "id": "18",
    "title": "Розділ 18. Проїзд маршрутних транспортних засобів",
    "description": "Перевага громадського транспорту та особливості руху біля зупинок.",
    "imagePath": null,
    "theory": [
      {
        "number": "18.1",
        "title": "Перевага маршрутних засобів",
        "text": "Автобуси, тролейбуси та інший маршрутний транспорт, що від’їжджає від зупинки, мають перевагу перед іншими транспортними засобами, якщо вони рухаються по смузі для громадського транспорту.",
        "imagePath": null
      },
      {
        "number": "18.2",
        "title": "Смуга для громадського транспорту",
        "text": "Іншим транспортним засобам заборонено рухатися або зупинятися на смузі, призначеній для маршрутних засобів, крім випадків повороту чи перестроювання.",
        "imagePath": null
      },
      {
        "number": "18.3",
        "title": "Безпека пасажирів",
        "text": "Під’їжджаючи до зупинки маршрутного транспорту, водій повинен зменшити швидкість і бути готовим зупинитися, якщо це необхідно для безпеки пасажирів.",
        "imagePath": null
      }
    ]
  },
  {
    "id": "19",
    "title": "Розділ 19. Проїзд пішохідних переходів і зупинок транспорту",
    "description": "Правила проїзду біля місць інтенсивного руху пішоходів.",
    "imagePath": null,
    "theory": [
      {
        "number": "19.1",
        "title": "Пішохідні переходи",
        "text": "Під’їжджаючи до пішохідного переходу, водій повинен зменшити швидкість і бути готовим зупинитися, щоб надати перевагу пішоходам, які переходять дорогу.",
        "imagePath": null
      },
      {
        "number": "19.2",
        "title": "Зупинки громадського транспорту",
        "text": "При наявності пішоходів поблизу зупинки водій повинен бути особливо уважним і не обганяти транспортний засіб, що зупинився для посадки чи висадки пасажирів.",
        "imagePath": null
      },
      {
        "number": "19.3",
        "title": "Діти та маломобільні особи",
        "text": "Особливу обережність слід проявляти біля шкіл, дитячих закладів та місць, де можуть перебувати люди з обмеженими можливостями.",
        "imagePath": null
      }
    ]
  },
  {
    "id": "20",
    "title": "Розділ 20. Користування зовнішніми світловими приладами",
    "description": "Правила використання фар, габаритних вогнів та інших світлових приладів.",
    "imagePath": null,
    "theory": [
      {
        "number": "20.1",
        "title": "Ближнє та дальнє світло",
        "text": "У темну пору доби та в умовах недостатньої видимості водій зобов’язаний вмикати ближнє або дальнє світло фар, не засліплюючи зустрічних водіїв.",
        "imagePath": null
      },
      {
        "number": "20.2",
        "title": "Денні ходові вогні",
        "text": "Поза населеними пунктами в світлу пору доби рекомендується або вимагається використовувати денні ходові вогні чи ближнє світло фар для кращої помітності автомобіля.",
        "imagePath": null
      },
      {
        "number": "20.3",
        "title": "Габаритні та протитуманні вогні",
        "text": "Габаритні та протитуманні фари застосовуються відповідно до дорожніх умов: туман, дощ, сніг чи погана видимість.",
        "imagePath": null
      }
    ]
  },
  {
    "id": "21",
    "title": "Розділ 21. Рух через залізничні переїзди",
    "description": "Правила безпечного проїзду через залізничні колії.",
    "imagePath": null,
    "theory": [
      {
        "number": "21.1",
        "title": "Під’їзд до переїзду",
        "text": "Під’їжджаючи до залізничного переїзду, водій повинен зменшити швидкість, оцінити сигнали світлофора, положення шлагбаума та знаки пріоритету.",
        "imagePath": null
      },
      {
        "number": "21.2",
        "title": "Заборона руху",
        "text": "Проїзд через переїзд заборонений при опущеному або такому, що починає опускатися, шлагбаумі, заборонному сигналі світлофора чи при наближенні поїзда.",
        "imagePath": null
      },
      {
        "number": "21.3",
        "title": "Вимушена зупинка",
        "text": "У разі вимушеної зупинки на коліях водій повинен негайно вжити заходів для евакуації людей і повідомлення чергових служб про небезпеку.",
        "imagePath": null
      }
    ]
  },
  {
    "id": "22",
    "title": "Розділ 22. Перевезення пасажирів",
    "description": "Вимоги до безпечного перевезення людей у транспортних засобах.",
    "imagePath": null,
    "theory": [
      {
        "number": "22.1",
        "title": "Кількість пасажирів",
        "text": "Перевозити пасажирів дозволяється лише в межах кількості місць, передбачених технічними характеристиками транспортного засобу.",
        "imagePath": null
      },
      {
        "number": "22.2",
        "title": "Ремені безпеки та крісла",
        "text": "Пасажири повинні користуватися ременями безпеки, а діти — утримуючими системами або автокріслами відповідного віку та ваги.",
        "imagePath": null
      },
      {
        "number": "22.3",
        "title": "Перевезення у вантажних авто",
        "text": "Перевезення людей у вантажних автомобілях допускається лише в обладнаних кузовах при дотриманні додаткових вимог безпеки.",
        "imagePath": null
      }
    ]
  },
  {
    "id": "23",
    "title": "Розділ 23. Перевезення вантажів",
    "description": "Правила перевезення вантажів з урахуванням маси, габаритів і кріплення.",
    "imagePath": null,
    "theory": [
      {
        "number": "23.1",
        "title": "Розміщення вантажу",
        "text": "Вантаж повинен бути рівномірно розміщений, надійно закріплений і не перекривати огляд дороги водієві та іншим учасникам руху.",
        "imagePath": null
      },
      {
        "number": "23.2",
        "title": "Габарити та маса",
        "text": "Перевезення негабаритних або великовагових вантажів потребує спеціального дозволу та дотримання встановлених маршрутів.",
        "imagePath": null
      },
      {
        "number": "23.3",
        "title": "Видимість і безпека",
        "text": "Вантаж не повинен закривати світлові прилади, номерні знаки та сигналізацію, а також створювати небезпеку випадіння на дорогу.",
        "imagePath": null
      }
    ]
  },
  {
    "id": "24",
    "title": "Розділ 24. Буксирування і експлуатація транспортних составів",
    "description": "Правила буксирування транспортних засобів та руху автопоїздів.",
    "imagePath": null,
    "theory": [
      {
        "number": "24.1",
        "title": "Способи буксирування",
        "text": "Буксирування може здійснюватися жорстким або гнучким зчепленням, а також частковим навантаженням. Обраний спосіб повинен відповідати технічним вимогам.",
        "imagePath": null
      },
      {
        "number": "24.2",
        "title": "Вимоги до водіїв",
        "text": "Водій буксируючого транспортного засобу несе відповідальність за безпеку руху всього составу, а водій буксированого — за дотримання дистанції та керування гальмами.",
        "imagePath": null
      },
      {
        "number": "24.3",
        "title": "Обмеження буксирування",
        "text": "Буксирування заборонене на гірських ділянках із крутими спусками, в ожеледицю та в інших умовах, коли це може створити загрозу безпеці.",
        "imagePath": null
      }
    ]
  },
  {
    "id": "25",
    "title": "Розділ 25. Навчальна їзда",
    "description": "Вимоги до навчальних транспортних засобів та учнів-водіїв.",
    "imagePath": null,
    "theory": [
      {
        "number": "25.1",
        "title": "Позначення навчального авто",
        "text": "Навчальний транспортний засіб повинен мати спеціальні позначення, а інструктор зобов’язаний мати можливість дублювати керування.",
        "imagePath": null
      },
      {
        "number": "25.2",
        "title": "Вік та підготовка учнів",
        "text": "До навчальної їзди допускаються особи, які досягли встановленого віку, пройшли теоретичну підготовку і медичний огляд.",
        "imagePath": null
      },
      {
        "number": "25.3",
        "title": "Відповідальність інструктора",
        "text": "Під час навчальної їзди за безпеку руху відповідає інструктор, який повинен контролювати дії учня та при необхідності втручатися в керування.",
        "imagePath": null
      }
    ]
  },
  {
    "id": "26",
    "title": "Розділ 26. Рух транспортних засобів у колонах",
    "description": "Правила організованого руху колон транспортних засобів.",
    "imagePath": null,
    "theory": [
      {
        "number": "26.1",
        "title": "Організована колона",
        "text": "Організована колона транспортних засобів рухається з узгодженою швидкістю, з постійною дистанцією між авто та під керівництвом старшого колони.",
        "imagePath": null
      },
      {
        "number": "26.2",
        "title": "Позначення колони",
        "text": "Транспортні засоби в колоні можуть позначатися прапорцями, проблисковими маячками чи іншими погодженими сигналами.",
        "imagePath": null
      },
      {
        "number": "26.3",
        "title": "В’їзд до колони",
        "text": "Іншим учасникам дорожнього руху забороняється без потреби в’їжджати між транспортні засоби організованої колони.",
        "imagePath": null
      }
    ]
  },
  {
    "id": "27",
    "title": "Розділ 27. Рух у житловій та пішохідній зоні",
    "description": "Особливі правила руху в дворах, житлових кварталах та пішохідних зонах.",
    "imagePath": null,
    "theory": [
      {
        "number": "27.1",
        "title": "Пріоритет пішоходів",
        "text": "У житловій та пішохідній зоні перевага надається пішоходам; вони можуть рухатися всією шириною дороги, а транспортні засоби повинні рухатися з мінімальною безпечною швидкістю.",
        "imagePath": null
      },
      {
        "number": "27.2",
        "title": "Обмеження швидкості",
        "text": "Швидкість руху у таких зонах значно обмежена, а будь-які маневри повинні виконуватися з особливою обережністю.",
        "imagePath": null
      },
      {
        "number": "27.3",
        "title": "Стоянка в житлових дворах",
        "text": "Організація стоянки в житлових дворах має забезпечувати вільний проїзд спецтранспорту та не перешкоджати руху пішоходів.",
        "imagePath": null
      }
    ]
  },
  {
    "id": "28",
    "title": "Розділ 28. Рух по автомагістралях і дорогах для автомобілів",
    "description": "Особливості руху на швидкісних дорогах.",
    "imagePath": null,
    "theory": [
      {
        "number": "28.1",
        "title": "Обмеження доступу",
        "text": "На автомагістралях заборонено рух пішоходів, велосипедистів, гужового транспорту, а також поворот ліворуч, розворот та рух заднім ходом.",
        "imagePath": null
      },
      {
        "number": "28.2",
        "title": "В’їзд та виїзд",
        "text": "В’їзд на автомагістраль і виїзд з неї здійснюються лише через спеціальні розв’язки, із завчасним набором або зменшенням швидкості на смузі розгону чи гальмування.",
        "imagePath": null
      },
      {
        "number": "28.3",
        "title": "Безпечна дистанція",
        "text": "Через підвищену швидкість руху на автомагістралях водій повинен збільшувати дистанцію до попереднього транспортного засобу.",
        "imagePath": null
      }
    ]
  },
  {
    "id": "29",
    "title": "Розділ 29. Рух по гірських дорогах і крутих спусках",
    "description": "Додаткові вимоги під час руху в гірській місцевості.",
    "imagePath": null,
    "theory": [
      {
        "number": "29.1",
        "title": "Вибір передачі",
        "text": "На крутих спусках необхідно використовувати понижену передачу, уникаючи тривалого гальмування тільки гальмами, щоб запобігти їх перегріву.",
        "imagePath": null
      },
      {
        "number": "29.2",
        "title": "Роз’їзд на вузьких ділянках",
        "text": "При зустрічному русі на вузьких гірських дорогах перевагу часто має транспортний засіб, що рухається вгору; водії повинні домовлятися жестами та сигналами.",
        "imagePath": null
      },
      {
        "number": "29.3",
        "title": "Безпека на серпантинах",
        "text": "Під час руху по серпантинах слід зменшувати швидкість перед кожним поворотом і враховувати можливу появу транспортних засобів чи перешкод за вигином дороги.",
        "imagePath": null
      }
    ]
  },
  {
    "id": "30",
    "title": "Розділ 30. Міжнародний рух",
    "description": "Особливості участі транспортних засобів у міжнародному дорожньому русі.",
    "imagePath": null,
    "theory": [
      {
        "number": "30.1",
        "title": "Документи для міжнародних поїздок",
        "text": "Транспортні засоби, що виїжджають за кордон, повинні мати необхідні документи: реєстраційні, страхові та, за потреби, міжнародне посвідчення водія.",
        "imagePath": null
      },
      {
        "number": "30.2",
        "title": "Національні та міжнародні норми",
        "text": "Водії повинні ознайомитися з особливостями дорожніх правил країни, до якої прямують, і дотримуватися міжнародних конвенцій з безпеки дорожнього руху.",
        "imagePath": null
      },
      {
        "number": "30.3",
        "title": "Розпізнавальні знаки держави",
        "text": "На транспортному засобі можуть бути розміщені розпізнавальні знаки держави реєстрації, що полегшують ідентифікацію на міжнародних дорогах.",
        "imagePath": null
      }
    ]
  },
  {
    "id": "31",
    "title": "Розділ 31. Номери, розпізнавальні знаки, написи і позначення",
    "description": "Вимоги до номерних знаків та додаткових позначень на транспортних засобах.",
    "imagePath": null,
    "theory": [
      {
        "number": "31.1",
        "title": "Державні реєстраційні номери",
        "text": "Транспортний засіб повинен мати справні та чисті номерні знаки, які не закриті елементами конструкції або додатковим обладнанням.",
        "imagePath": null
      },
      {
        "number": "31.2",
        "title": "Розпізнавальні знаки",
        "text": "На окремих категоріях транспортних засобів можуть розміщуватися спеціальні знаки: «Учбовий», «Діти», «Опасний вантаж», «Таксі» тощо.",
        "imagePath": null
      },
      {
        "number": "31.3",
        "title": "Рекламні та інформаційні написи",
        "text": "Рекламні наклейки та написи не повинні погіршувати оглядовість, закривати світлові прилади чи вводити в оману інших учасників руху.",
        "imagePath": null
      }
    ]
  },
  {
    "id": "32",
    "title": "Розділ 32. Технічний стан транспортних засобів",
    "description": "Перелік основних вимог до справності автомобіля.",
    "imagePath": null,
    "theory": [
      {
        "number": "32.1",
        "title": "Справність гальмівної системи",
        "text": "Гальмівна система повинна забезпечувати ефективне гальмування; за наявності несправностей рух транспортного засобу забороняється.",
        "imagePath": null
      },
      {
        "number": "32.2",
        "title": "Освітлювальні прилади та склоочисники",
        "text": "Фари, габаритні вогні, покажчики повороту й склоочисники повинні бути справними, особливо в умовах недостатньої видимості.",
        "imagePath": null
      },
      {
        "number": "32.3",
        "title": "Шини та рульове керування",
        "text": "Глибина протектора шин і відсутність пошкоджень мають відповідати нормам, а рульове керування — забезпечувати точне та безпечне керування транспортним засобом.",
        "imagePath": null
      }
    ]
  },
  {
    "id": "33",
    "title": "Розділ 33. Окремі питання дорожнього руху, що потребують узгодження",
    "description": "Питання організації дорожнього руху, які вирішуються місцевими органами влади та службами.",
    "imagePath": null,
    "theory": [
      {
        "number": "33.1",
        "title": "Організація руху",
        "text": "Зміна організації дорожнього руху, встановлення нових знаків, світлофорів і розмітки здійснюється за погодженням з уповноваженими органами.",
        "imagePath": null
      },
      {
        "number": "33.2",
        "title": "Тимчасова організація",
        "text": "Під час проведення ремонтних робіт або масових заходів можуть встановлюватися тимчасові схеми організації руху.",
        "imagePath": null
      },
      {
        "number": "33.3",
        "title": "Інформування учасників руху",
        "text": "Про зміни організації руху водії мають бути завчасно поінформовані за допомогою дорожніх знаків, табло чи інших технічних засобів.",
        "imagePath": null
      }
    ]
  },
  {
    "id": "34",
    "title": "Розділ 34. Дорожня розмітка",
    "description": "Типи, кольори та значення ліній на проїзній частині.",
    "imagePath": null,
    "theory": [
      {
        "number": "34.1",
        "title": "Поздовжня розмітка",
        "text": "Суцільні та переривчасті лінії поздовжньої розмітки розділяють потоки транспорту та визначають межі смуг руху, зокрема місця, де заборонено обгін чи перестроювання.",
        "imagePath": null
      },
      {
        "number": "34.2",
        "title": "Поперечна розмітка",
        "text": "Поперечні лінії вказують місця зупинки перед світлофорами чи знаками, пішохідні переходи, стоп-лінії та інші важливі елементи.",
        "imagePath": null
      },
      {
        "number": "34.3",
        "title": "Спеціальна розмітка",
        "text": "Стрілки напрямку руху, позначення смуг громадського транспорту, велодоріжок та інших зон допомагають водіям орієнтуватися на дорозі й дотримуватися встановленого режиму.",
        "imagePath": null
      }
    ]
  }
]
