import 'dart:convert';
import 'db_helper.dart';

Future<void> seedDatabase() async {
  final db = DBHelper();

  final existingSections = await db.getSections();
  if (existingSections.isNotEmpty) {
    print('⚠️ Дані вже існують — пропускаємо seed.');
    return;
  }

  final sections = [
    {
      'title': 'Розділ 1. Загальні положення',
      'description': 'Основні терміни, визначення і принципи дорожнього руху.',
      'content': [
        {
          'number': '1.1',
          'text': '''
          Ці Правила відповідно до Закону України «Про дорожній рух» встановлюють єдиний порядок дорожнього руху на всій території України.
          
          На даний час в Україні діють єдині правила дорожнього руху, які мають нормативний характер. Вони базуються постановою КМУ від
          10 жовтня 2001 року №1306 і базуються на законі України "Про дорожній рух".
          
          Аналогічні документи існують у всіх цивілізований країнах.
          
          Правила дорожнього руху не повинні суперечити Конституції України та інших законодавчим актам України. 
          
          '''
        },
        {
          'number': '1.2',
          'text': 'В Україні встановлено правосторонній рух транспортних засобів.',
          'imagePath': 'assets/images/right_drive.jpg'
        },
        {
          'number': '1.3',
          'text':
          'Учасники дорожнього руху зобов’язані знати і неухильно виконувати вимоги цих Правил.'
        },
        {
          'number': '1.4',
          'text':
          'Кожен учасник дорожнього руху має право розраховувати на те, що інші учасники виконують ці Правила.'
        },
      ],
    },
  ];

  for (var section in sections) {
    final fixedSection = Map<String, dynamic>.from(section);
    final content = section['content'];

    fixedSection['content'] = jsonEncode(content);

    await db.insertSection(fixedSection);
  }

  print('🎉 База заповнена правильно!');
}
